[
	{
		"author": "Abraham Lincoln",
		"quote": "Important principles may, and must, be inflexible."
	},
	{
		"author": "Abraham Lincoln",
		"quote": "I walk slowly, but I never walk backward."
	},
	{
		"author": "Albert Einstein",
		"quote": "God always takes the simplest way."
	},
	{
		"author": "Albert Einstein",
		"quote": "The only real valuable thing is intuition."
	},
	{
		"author": "Albert Einstein",
		"quote": "Once we accept our limits, we go beyond them."
	},
	{
		"author": "Albert Einstein",
		"quote": "Try not to become a man of success, but rather try to become a man of value."
	},
	{
		"author": "Albert Einstein",
		"quote": "When the solution is simple, God is answering."
	},
	{
		"author": "Albert Einstein",
		"quote": "A man should look for what is, and not for what he thinks should be."
	},
	{
		"author": "Albert Einstein",
		"quote": "Imagination is more important than knowledge. For while knowledge defines all we currently know and understand, imagination points to all we might yet discover and create."
	},
	{
		"author": "Albert Einstein",
		"quote": "We cannot solve our problems with the same thinking we used when we created them."
	},
	{
		"author": "Albert Einstein",
		"quote": "If you can't explain it simply, you don't understand it well enough."
	},
	{
		"author": "Albert Einstein",
		"quote": "The true sign of intelligence is not knowledge but imagination."
	},
	{
		"author": "Albert Einstein",
		"quote": "Logic will get you from A to B. Imagination will take you everywhere."
	},
	{
		"author": "Albert Einstein",
		"quote": "Great ideas often receive violent opposition from mediocre minds."
	},
	{
		"author": "Albert Einstein",
		"quote": "Anyone who doesn't take truth seriously in small matters cannot be trusted in large ones either."
	},
	{
		"author": "Albert Einstein",
		"quote": "There are only two ways to live your life. One is as though nothing is a miracle. The other is as though everything is a miracle."
	},
	{
		"author": "Albert Einstein",
		"quote": "A person who never made a mistake never tried anything new."
	},
	{
		"author": "Albert Einstein",
		"quote": "I have no special talent. I am only passionately curious."
	},
	{
		"author": "Albert Schweitzer",
		"quote": "Do something wonderful, people may imitate it."
	},
	{
		"author": "Albert Schweitzer",
		"quote": "Success is not the key to happiness. Happiness is the key to success. If you love what you are doing, you will be successful."
	},
	{
		"author": "Albert Schweitzer",
		"quote": "An optimist is a person who sees a green light everywhere, while the pessimist sees only the red spotlight... The truly wise person is colour-blind."
	},
	{
		"author": "Aldous Huxley",
		"quote": "There is only one corner of the universe you can be certain of improving, and that's your own self."
	},
	{
		"author": "Aldous Huxley",
		"quote": "Experience is not what happens to a man. It is what a man does with what happens to him."
	},
	{
		"author": "Alexander Pope",
		"quote": "Blessed is the man who expects nothing, for he shall never be disappointed."
	},
	{
		"author": "Alexander the Great",
		"quote": "There is nothing impossible to him who will try."
	},
	{
		"author": "Alexis Carrel",
		"quote": "All great men are gifted with intuition. They know without reasoning or analysis, what they need to know."
	},
	{
		"author": "Alfred Sheinwold",
		"quote": "Learn all you can from the mistakes of others. You won't have time to make them all yourself."
	},
	{
		"author": "Anais Nin",
		"quote": "The possession of knowledge does not kill the sense of wonder and mystery. There is always more mystery."
	},
	{
		"author": "Anatole France",
		"quote": "To accomplish great things, we must not only act, but also dream; not only plan, but also believe."
	},
	{
		"author": "Anatole France",
		"quote": "It is better to understand a little than to misunderstand a lot."
	},
	{
		"author": "Anne Wilson Schaef",
		"quote": "Trusting our intuition often saves us from disaster."
	},
	{
		"author": "Aristotle",
		"quote": "Well begun is half done."
	},
	{
		"author": "Arthur Schopenhauer",
		"quote": "Every man takes the limits of his own field of vision for the limits of the world."
	},
	{
		"author": "Benjamin Franklin",
		"quote": "Well done is better than well said."
	},
	{
		"author": "Buckminster Fuller",
		"quote": "You never change things by fighting the existing reality. To change something, build a new model that makes the existing model obsolete"
	},
	{
		"author": "Byron Pulsifer",
		"quote": "The best teacher is experience learned from failures."
	},
	{
		"author": "Byron Pulsifer",
		"quote": "To give hope to someone occurs when you teach them how to use the tools to do it for themselves."
	},
	{
		"author": "Byron Pulsifer",
		"quote": "Courage is not about taking risks unknowingly but putting your own being in front of challenges that others may not be able to."
	},
	{
		"author": "Byron Pulsifer",
		"quote": "Responsibility is not inherited, it is a choice that everyone needs to make at some point in their life."
	},
	{
		"author": "Charles Chesnutt",
		"quote": "Impossibilities are merely things which we have not yet learned."
	},
	{
		"author": "Chinese proverb",
		"quote": "Talk doesn't cook rice."
	},
	{
		"author": "Dale Carnegie",
		"quote": "Most of the important things in the world have been accomplished by people who have kept on trying when there seemed to be no hope at all."
	},
	{
		"author": "Epictetus",
		"quote": "Keep silence for the most part, and speak only when you must, and then briefly."
	},
	{
		"author": "Epictetus",
		"quote": "It is impossible for a man to learn what he thinks he already knows."
	},
	{
		"author": "Ernest Hemingway",
		"quote": "I like to listen. I have learned a great deal from listening carefully. Most people never listen."
	},
	{
		"author": "Everett Dirksen",
		"quote": "I am a man of fixed and unbending principles, the first of which is to be flexible at all times."
	},
	{
		"author": "Galileo Galilei",
		"quote": "All truths are easy to understand once they are discovered; the point is to discover them."
	},
	{
		"author": "Georg Lichtenberg",
		"quote": "I cannot say whether things will get better if we change; what I can say is they must change if they are to get better."
	},
	{
		"author": "German proverb",
		"quote": "Silence is a fence around wisdom."
	},
	{
		"author": "Gloria Steinem",
		"quote": "If the shoe doesn't fit, must we change the foot?"
	},
	{
		"author": "Henry Ford",
		"quote": "Quality means doing it right when no one is looking."
	},
	{
		"author": "John Powell",
		"quote": "The only real mistake is the one from which we learn nothing."
	},
	{
		"author": "Margaret Mead",
		"quote": "Never doubt that a small group of thoughtful, committed people can change the world. Indeed. It is the only thing that ever has."
	},
	{
		"author": "Mary Bethune",
		"quote": "Without faith, nothing is possible. With it, nothing is impossible."
	},
	{
		"author": "Mary Kay Ash",
		"quote": "Aerodynamically the bumblebee shouldn't be able to fly, but the bumblebee doesn't know that so it goes on flying anyway."
	},
	{
		"author": "Napoleon Bonaparte",
		"quote": "If you want a thing done well, do it yourself."
	},
	{
		"author": "Pablo Picasso",
		"quote": "I am always doing that which I can not do, in order that I may learn how to do it."
	},
	{
		"author": "Philip Sidney",
		"quote": "Either I will find a way, or I will make one."
	},
	{
		"author": "Plato",
		"quote": "A good decision is based on knowledge and not on numbers."
	},
	{
		"author": "Ralph Emerson",
		"quote": "Skill to do comes of doing."
	},
	{
		"author": "Rene Descartes",
		"quote": "Divide each difficulty into as many parts as is feasible and necessary to resolve it."
	},
	{
		"author": "Richard Bach",
		"quote": "The simplest things are often the truest."
	},
	{
		"author": "Robert Anthony",
		"quote": "Forget about all the reasons why something may not work. You only need to find one good reason why it will."
	},
	{
		"author": "Robert Frost",
		"quote": "The best way out is always through."
	},
	{
		"author": "Terry Tempest Williams",
		"quote": "Creativity involves breaking out of expected patterns in order to look at things in a different way."
	},
	{
		"author": "Thomas Carlyle",
		"quote": "This world, after all our science and sciences, is still a miracle; wonderful, inscrutable, magical and more, to whosoever will think of it."
	},
	{
		"author": "Unknown",
		"quote": "The definition of insanity is doing the same thing over and over again and expecting a different result."
	},
	{
		"author": "Vernon Cooper",
		"quote": "These days people seek knowledge, not wisdom. Knowledge is of the past, wisdom is of the future."
	},
	{
		"quote": "Ask and it will be given to you; search, and you will find; knock and the door will be opened for you.",
		"author": "Jesus"
	},
	{
		"quote": "I didn’t fail the test. I just found 100 ways to do it wrong.",
		"author": "Benjamin Franklin"
	},
	{
		"quote": "Never promise more than you can perform.",
		"author": "Publilius Syrus"
	},
	{
		"quote": "If you don't know where you are going, any road will get you there.",
		"author": "Lewis Carroll"
	},
	{
		"quote": "He who knows, does not speak. He who speaks, does not know.",
		"author": "Laozi"
	},
	{
		"quote": "True knowledge exists in knowing that you know nothing.",
		"author": "Isocrates"
	},
	{
		"quote": "Quick decisions are unsafe decisions.",
		"author": "Sophocles"
	},
	{
		"quote": "Great ideas often receive violent opposition from mediocre minds.",
		"author": "Albert Einstein"
	},
	{
		"quote": "You can't cross the sea merely by standing and staring at the water.",
		"author": "Rabindranath Tagore"
	},
	{
		"quote": "Technology has to be invented or adopted.",
		"author": "Jared Diamond"
	},
	{
		"quote": "It always seems impossible until it's done.",
		"author": "Nelson Mandela"
	},
	{
		"quote": "Well done is better than well said.",
		"author": "Benjamin Franklin"
	},
	{
		"quote": "Give me a lever long enough and a fulcrum on which to place it, and I shall move the world.",
		"author": "Archimedes"
	},
	{
		"quote": "Blessed is the man who expects nothing, for he shall never be disappointed.",
		"author": "Alexander Pope"
	},
	{
		"author": "Amar Bose",
		"quote": "If you think something is impossible, don't disturb the person doing it."
	},
	{
		"author": "Lao Tse",
		"quote": "A leader is best when people barely know he exists, when his work is done, his aim fulfilled, they will say: we did it ourselves."
	},
	{
		"author": "John Dewey",
		"quote": "An ounce of experience is better than a ton of theory simply."
	},
	{
		"author": "Paul Buchheit",
		"quote": "The first thing I do on day one is build something useful, then just keep improving it."
	},
	{
		"author": "Samuel Goldwyn",
		"quote": "If I look confused it is because I am thinking."
	},
	{
		"author": "Steve Jobs",
		"quote": "Creativity is just connecting things. When you ask creative people how they did something, they feel a little guilty because they didn't really do it, they just saw something. It seemed obvious to them after a while. That's because they were able to connect experiences they've had and synthesize new things."
	},
	{
		"author": "Steve Jobs",
		"quote": "If you do something and it turns out pretty good, then you should go do something else wonderful, not dwell on it for too long. Just figure out what’s next."
	},
	{
		"author": "Ralph Waldo Emerson",
		"quote": "Do not go where the path may lead, go instead where there is no path and leave a trail."
	},
	{
		"author": "Reid Hoffman",
		"quote": "If you’re not a embarrassed by the first version of your product, you launched to late."
	},
	{
		"author": "Richard Brandson",
		"quote": "You earn trust by providing innovative, quality products and keeping your word."
	},
	{
		"author": "Seneca The Younger",
		"quote": "While we teach, we learn."
	},
	{
		"author": "Sophocles",
		"quote": "One must learn by doing the thing; for though you think you know it, you have no certainty until you try."
	},
	{
		"author": "Galileo Galilei",
		"quote": "Mathematics is the alphabet that God used to describe the universe."
	}
]